Merge pull request #161 from wiwaszko-intel/DOCS-Update-docs-from-documentation-repo
[DOCS] Update docs from documentation repo
